Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: In most cases you use LVGL's Drawing API through the API of Widgets: by creating buttons, labels, etc., and setting the their styles, positions, and other properties.
it_it: Nella maggior parte dei casi si utilizza l'API di Disegno di LVGL tramite quella dei Widget: creando pulsanti, etichette, ecc. e impostandone stili, posizioni e altre proprietà.

source: In most cases, style properties map 1-to-1 to draw descriptor fields.
it_it: Nella maggior parte dei casi, le proprietà di stile vengono mappate 1 a 1 ai campi dei descrittori di disegno.

source: In most cases, the *"Clip Radius of Images"* method is better because it blends the layer with a radius mask on the fly, avoiding a dedicated masking step.
it_it: Nella maggior parte dei casi, il metodo del *"Ritagliare il Raggio Immagini"* è migliore perché fonde il layer con una maschera di raggio al volo, evitando una fase di mascheratura dedicata.

source: In most cases, the API functions of LVGL widgets are structured like:
it_it: Nella maggior parte dei casi, le funzioni API dei widget LVGL sono strutturate come segue:

source: In most of the cases XML property names don't have special syntax.
it_it: Nella maggior parte dei casi, i nomi delle proprietà XML non hanno una sintassi speciale.

source: In order to avoid hard codding the device card path, you can ask LVGL to find a connected one for you using :cpp:func:`lv_linux_drm_find_device_path`.
it_it: Per evitare di dover scrivere a mano il path della scheda del dispositivo, si può chiedere a LVGL di trovarne una connessa tramite :cpp:func:`lv_linux_drm_find_device_path`.

source: In order to connect LVGL to the hardware an :cpp:expr:`lv_display_t` object needs to be created and initialized.
it_it: Per collegare LVGL all'hardware, è necessario creare e inizializzare un oggetto :cpp:expr:`lv_display_t`.

source: In order to do so, SPIRAM will need to be enabled in the menuconfig options for your given espressif chip.
it_it: Per fare ciò, è necessario abilitare SPIRAM nelle opzioni di menuconfig del chip Espressif in uso.

source: In order to pass initialization of the lv_rlottie_t object, you need 240x320x32/8 (307k) available memory.
it_it: Per superare l'inizializzazione dell'oggetto lv_rlottie_t, è necessaria una memoria disponibile di 240x320x32/8 (307k).

source: In order to read them, you must first register an event callback.
it_it: Per leggerle, è necessario prima registrare una callback di evento.

source: In order to render the animation a buffer needs to be assigned to the Lottie Widget.
it_it: Per eseguire il rendering dell'animazione, è necessario assegnare un buffer al Widget Lottie.

source: In order to use File Explorer, :ref:`file_system` has to be set up and know about all the drive letters you use when passing paths to File System (described below).
it_it: Per poter utilizzare "File Explorer", è necessario impostare :ref:`file_system` e conoscere tutte le lettere di unità utilizzate quando si passano i path al file system (descritto di seguito).

source: In order to use G2D as a draw unit, select in "lv_conf.h": Set :c:macro:`LV_USE_DRAW_G2D` to `1`.
it_it: Per utilizzare G2D come unità di disegno, selezionare in "lv_conf.h": Impostare :c:macro:`LV_USE_DRAW_G2D` a `1`.

source: In order to use Lottie animations :c:macro:`LV_USE_THORVG_INTERNAL` (to use the built-in ThorVG) or :c:macro:`LV_USE_THORVG_EXTERNAL` (to link it externally) needs to be enabled in ``lv_conf.h``.
it_it: Per utilizzare le animazioni Lottie, è necessario abilitare :c:macro:`LV_USE_THORVG_INTERNAL` (per utilizzare il ThorVG integrato) o :c:macro:`LV_USE_THORVG_EXTERNAL` (per linkarlo esternamente) in ``lv_conf.h``.

source: In order to use PXP as a draw unit, select in "lv_conf.h": Set :c:macro:`LV_USE_DRAW_PXP` to `1`.
it_it: Per utilizzare PXP come unità di disegno, selezionare in "lv_conf.h": Impostare :c:macro:`LV_USE_DRAW_PXP` a `1`.

source: In order to use PXP to rotate the screen, select in "lv_conf.h": Set :c:macro:`LV_USE_ROTATE_PXP` to `1`.
it_it: Per utilizzare PXP per ruotare lo schermo, selezionare in "lv_conf.h": Impostare :c:macro:`LV_USE_ROTATE_PXP` a `1`.

source: In other words the "self height" is 500 px.
it_it: In altre parole, la "self height" è di 500 px.

source: In other words they cannot be local variables in functions which are no longer valid after the function exits.
it_it: In altre parole, non possono essere variabili locali in funzioni le quali non sono più valide dopo l'uscita dalla funzione.

source: In other words transformations work only on normal (A)RGB or A8 images stored as a C array, or on images provided by a custom :ref:`image_decoders` that returns the whole image.
it_it: In altre parole, le trasformazioni funzionano solo su immagini (A)RGB o A8 normali memorizzate come array C, oppure su immagini fornite da un :ref:`image_decoders` personalizzato che restituisce l'immagine intera.

source: In other words, LVGL can read the XML files, "learn" the Components from them, and thereafter create children as part of Screens and other Components.
it_it: In altre parole, LVGL può leggere i file XML, "apprendere" i Componenti da essi e, successivamente, creare elementi figlio come parte di Screen e altri Componenti.

source: In other words, the angle and value settings are independent.
it_it: In altre parole, le impostazioni di angolo e valore sono indipendenti.

source: In particular a correct gamma setup is crucial for good color reproduction.
it_it: In particolare, una corretta impostazione della gamma è fondamentale per una buona riproduzione dei colori.

source: In particular, the generic MIPI driver accepts the following flags:
it_it: In particolare, il driver MIPI generico accetta i seguenti flag:

source: In password mode :cpp:expr:`lv_textarea_get_text(textarea)` returns the actual text entered, not the bullet characters.
it_it: In modalità password, :cpp:expr:`lv_textarea_get_text(textarea)` restituisce il testo effettivamente inserito, non i caratteri del punto elenco.

source: In practice it's also possible to mix these options, for example provide a struct pointer when registering a callback (option 1) and provide ``user_data`` argument when calling the callback (options 2), **as long as the same** ``user_data`` **that was registered is passed to the callback when it's called**.
it_it: In pratica è anche possibile combinare queste opzioni, ad esempio fornire un puntatore a struct quando si registra una callback (opzione 1) e fornire l'argomento ``user_data`` quando si chiama la callback (opzione 2), **purché lo stesso** ``user_data`` **registrato venga passato alla callback quando viene chiamata**.

source: In practice this means waiting without a timeout for some external event.
it_it: In pratica, questo significa attendere senza timeout un evento esterno.

source: In practice you need to call these functions:
it_it: In pratica, è necessario chiamare queste funzioni:

source: In practice, during rendering, Dave2D can reduce the CPU usage by half to one-third, depending on the application.
it_it: In pratica, durante il rendering, Dave2D può ridurre l'utilizzo della CPU dalla metà a un terzo, a seconda dell'applicazione.

source: In practice, it looks like this:
it_it: In pratica, si presenta così:

source: In practice, there is no dedicated outline descriptor like ``lv_draw_outline_dsc_t``, because from the rendering perspective, the outline is simply another border rendered outside the object's bounds.
it_it: In pratica, non esiste un descrittore di contorno dedicato come ``lv_draw_outline_dsc_t``, perché dal punto di vista del rendering, il contorno è semplicemente un altro bordo renderizzato all'esterno dei limiti dell'oggetto.

source: In practice, this means when the input device wants to focus the next or previous widget (:cpp:enumerator:`LV_KEY_NEXT` and :cpp:enumerator:`LV_KEY_PREV`), it will search for the widget in the assigned group.
it_it: In pratica, questo significa che quando il dispositivo di input desidera porre il focus sul widget successivo o precedente (:cpp:enumerator:`LV_KEY_NEXT` e :cpp:enumerator:`LV_KEY_PREV`), cercherà il widget nel gruppo assegnato.

source: In runtime, the event handler function from the eLCDIF driver should be called inside of the eLCDIF interrupt handler This function is responsible for notify the LVGL display subsystem about a finished flush operation:
it_it: In fase di runtime, la funzione di gestione eventi del driver eLCDIF deve essere chiamata all'interno del gestore di interrupt eLCDIF. Questa funzione è responsabile della notifica al sottosistema di visualizzazione LVGL del completamento dell'operazione di flush:

source: In short, encoder input devices work like this:
it_it: In breve, i dispositivi di input encoder funzionano in questo modo:

source: In short, self size establishes the size of a Widget's content.
it_it: In breve, il self size stabilisce la dimensione del contenuto di un Widget.

source: In short, this means:
it_it: In breve, questo significa:

source: In some cases it is desirable to set the Slider to react on dragging the knob only.
it_it: In alcuni casi è preferibile impostare lo Slider in modo che reagisca solo al trascinamento della manopola.

source: In some cases, it might be necessary to extend the generated code with hand-written code.
it_it: In alcuni casi, potrebbe essere necessario estendere il codice generato con codice scritto a mano.

source: In such a configuration the callbacks must be able to distinguish between the displays.
it_it: In una configurazione di questo tipo, le callback devono essere in grado di distinguere tra i display.

source: In summary, to enable transparent screens and displays for OSD menu-like UIs:
it_it: In sintesi, per abilitare schermi e display trasparenti per interfacce utente simili a menù OSD:

source: In summary: inside ``<animations>``, you can define ``<timeline>``\ s, each with a unique name that you can reference later.
it_it: In sintesi: all'interno di ``<animations>``, si possono definire le ``<timeline>``, ciascuna con un nome univoco a cui si potrà fare riferimento in seguito.

source: In the "Manage Solution" view explained in the guide, there is an option to select either an HP target or an HE target.
it_it: Nella vista "Manage Solution" illustrata nella guida, è possibile selezionare un target HP o un target HE.

source: In the Easy Installer, select TorizonCore as the operating system to install.
it_it: Nell'Easy Installer, selezionare TorizonCore come sistema operativo da installare.

source: In the INO file you can see how to register a display and a touchpad for LVGL and call an example.
it_it: Nel file INO si può vedere come registrare un display e un touchpad per LVGL e chiamare un esempio.

source: In the Perfetto UI, use the :kbd:`A` or :kbd:`D` keys to pan the timeline horizontally and the :kbd:`W` or :kbd:`S` keys to zoom in or out on the timeline.
it_it: Nell'interfaccia utente di Perfetto, si utilizzano i tasti :kbd:`A` e :kbd:`D` per spostare orizzontalmente la timeline e i tasti :kbd:`W` e :kbd:`S` per ingrandire o ridurre la timeline.

source: In the STM32CubeIDE **Project Explorer** pane: right click on the LVGL folder and select **Add/remove include path…**.
it_it: Nel riquadro **Project Explorer** di STM32CubeIDE : click destro sulla cartella LVGL e selezionare **Add/remove include path…**.

source: In the UI editor, they can also be described in XML to create visuals more quickly and export C code.
it_it: Nell'editor dell'interfaccia utente, possono anche essere descritti in XML per creare elementi visivi più rapidamente ed esportare codice C.

source: In the UI |nbsp| Editor, when a Screen is being developed, the user can select from all the defined displays in the Preview, and the Screen will be shown with the given resolution and color depth.
it_it: Nell'Editor dell'Interfaccia Utente, quando si sviluppa una schermata, l'utente può selezionare tra tutti i display definiti nell'Anteprima e la Schermata verrà visualizzata con la risoluzione e la profondità di colore specificate.

source: In the `Blog <https://blog.lvgl.io/2019-08-05/micropython-pure-display-driver#using-callbacks>`__ and in the `README <https://github.com/lvgl/lv_binding_micropython#callbacks>`__
it_it: Nel `Blog <https://blog.lvgl.io/2019-08-05/micropython-pure-display-driver#using-callbacks>`__ e nel `README <https://github.com/lvgl/lv_binding_micropython#callbacks>`__

source: In the ``<styles>`` section, styles and their properties can be defined like this:
it_it: Nella sezione ``<styles>``, gli stili e le loro proprietà possono essere definiti in questo modo:

source: In the ``CMakeLists.txt`` file of the ``ui_project/`` directory, created by the LVGL Editor, add:
it_it: Nel file ``CMakeLists.txt`` della directory ``ui_project/``, creato da LVGL Editor, aggiungere:

source: In the ``LVGL_Arduino.ino`` example there is a ``my_print`` method, which sends this debug information to the serial interface.
it_it: Nell'esempio ``LVGL_Arduino.ino`` è presente il metodo ``my_print``, che invia queste informazioni di debug all'interfaccia seriale.

source: In the ``Search Results`` window, the ``Depends on`` section lists the required packages or options that need to be enabled (or disabled) to make the target package configurable.
it_it: Nella finestra ``Search Results``, la sezione ``Depends on`` elenca i pacchetti o le opzioni richiesti che devono essere abilitati (o disabilitati) per rendere configurabile il pacchetto target.

source: In the ``docker run`` command you use to create the dev container, include ``--device /dev/ttyACM0 --device /dev/ttyACM1`` to give the container access to those ports so you can flash from it.
it_it: Nel comando ``docker run`` utilizzato per creare il container di sviluppo, includere ``--device /dev/ttyACM0 --device /dev/ttyACM1`` per consentire al container di accedere a quelle porte in modo da poter eseguire il flashing da esso.

source: In the ``lvgl_yocto_guide/build/tmp/work/cortexa53-poky-linux/lvgl/9.1.0`` folder, you can now find the source code in ``git`` (as it was defined in the recipe).
it_it: Nella cartella ``lvgl_yocto_guide/build/tmp/work/cortexa53-poky-linux/lvgl/9.1.0``, ora si può trovare il codice sorgente in ``git`` (come definito nella ricetta).

source: In the ``lvgl`` repo both fixes and new features should be directed to the ``master`` branch.
it_it: Nel repository ``lvgl``, sia le correzioni che le nuove funzionalità devono essere indirizzate al branch ``master``.

source: In the ``sources`` folder, a new folder was created: ``meta-mylvgl`` and the directory tree should look like the following
it_it: Nella cartella ``sources``, è stata creata una nuova cartella: ``meta-mylvgl`` e l'albero delle directory dovrebbe apparire come segue.

source: In the below example, ``1125K`` is specified because the color depth is 24 (3 bytes per pixel), the display width is 800, the display height is 480, and ``1K`` means 1024 bytes.
it_it: Nell'esempio seguente, ``1125K`` è specificato perché la profondità di colore è 24 (3 byte per pixel), la larghezza del display è 800, l'altezza del display è 480 e ``1K`` significa 1024 byte.

source: In the best case where the cache size is \>= the size of the file, ``read`` will only be called once.
it_it: Nel caso migliore, quando la dimensione della cache è \>= la dimensione del file, ``read`` verrà chiamata una sola volta.

source: In the build directory, there is a ``conf`` folder with some files in it
it_it: Nella directory di build, c'è una cartella ``conf`` con alcuni file al suo interno

source: In the build folder, you can now see the built library.
it_it: Nella cartella di build, ora è possibile visualizzare la libreria compilata.

source: In the case of :cpp:enumerator:`LV_DISPLAY_RENDER_MODE_PARTIAL` the small rendered areas can be rotated on their own before flushing to the frame buffer.
it_it: Nel caso di :cpp:enumerator:`LV_DISPLAY_RENDER_MODE_PARTIAL` le piccole aree renderizzate possono essere ruotate autonomamente prima di essere riversate nel frame buffer.

source: In the case of ``libinput``, touch events are received asynchronously.
it_it: Nel caso di ``libinput``, gli eventi touch vengono ricevuti in modo asincrono.

source: In the case of binary (.bin) files, you need to specify the color format you want:
it_it: Nel caso di file binari (.bin), è necessario specificare il formato colore desiderato:

source: In the case of monochrome displays, `x1` must be `Nx8`, and `x2` must be `Nx8 - 1`.
it_it: Nel caso di display monocromatici, `x1` deve essere `Nx8` e `x2` deve essere `Nx8 - 1`.

source: In the code generated by LVGL's UI Editor, these are passed as arguments in create/set functions.
it_it: Nel codice generato dall'editor dell'interfaccia utente di LVGL, questi vengono passati come argomenti nelle funzioni create/set.

source: In the context of pixel rendering (drawing), there are :ref:`draw_layers`.
it_it: Nel contesto del rendering pixel (disegno), ci sono :ref:`draw_layers`.

source: In the context of word-wrapped text, any Recoloring started on a line will be terminated at the end of the line where the line is wrapped if it was not already terminated by an ending ``#`` in the text.
it_it: Nel contesto del testo con ritorno a capo automatico, qualsiasi ricolorazione avviata su una riga verrà terminata alla fine della riga in cui la riga è andata a capo, se non era già terminata da un ``#`` finale nel testo.

source: In the devicetree file ``<your_board>.dts`` and/or overlay ``<your_overlay>.overlay``, you must configure the specific nodes for your hardware's display and touchscreen.
it_it: Nel file devicetree ``<your_board>.dts`` e/o nell'overlay ``<your_overlay>.overlay``, è necessario configurare i nodi specifici per il display e il touchscreen dell'hardware.

source: In the dialog that appears, click on "Local..." and browse to the folder where you extracted the plugin.
it_it: Nella finestra di dialogo che appare, cliccare su "Local..." e spostarsi nella cartella in cui è stato estratto il plugin.

source: In the end, the goal is to run it all on an embedded platform.
it_it: In definitiva, l'obiettivo è eseguire il tutto su una piattaforma embedded.

source: In the event :cpp:expr:`lv_event_get_prev_state(e)` returns the previous state and :cpp:expr:`lv_obj_get_state(obj)` returns the current state.
it_it: Nell'evento :cpp:expr:`lv_event_get_prev_state(e)` restituisce lo stato precedente e :cpp:expr:`lv_obj_get_state(obj)` restituisce lo stato corrente.

source: In the event that the Animation completes *after* you have determined it needs to be deleted, and before the call to :cpp:func:`lv_anim_delete` is made, it does no harm to call it a second time --- no damage will occur.
it_it: Nel caso in cui l'animazione venga completata *dopo* aver determinato che deve essere eliminata e prima che venga effettuata la chiamata a :cpp:func:`lv_anim_delete`, non c'è alcun problema a richiamarla una seconda volta: non si verificherà alcun danno.

source: In the example :cpp:enumerator:`LV_EVENT_CLICKED` means that only the click event will call ``my_event_cb``.
it_it: Nell'esempio :cpp:enumerator:`LV_EVENT_CLICKED` significa che solo l'evento clic chiamerà ``my_event_cb``.

source: In the example, a ``<my_header>`` and a ``<my_main_cont>`` component are used to keep the screen simple.
it_it: Nell'esempio, vengono utilizzati i componenti ``<my_header>`` e ``<my_main_cont>`` per semplificare la schermata.

source: In the exported C code, it is assumed that a function with the exact name exists.
it_it: Nel codice C esportato, si presume che esista una funzione con lo stesso nome.

source: In the exported code, the return value will be saved in a ``my_data_t *`` variable.
it_it: Nel codice esportato, il valore restituito verrà salvato in una variabile ``my_data_t *``.

source: In the file ``build/conf/local.conf``, add these 2 lines at the end of the file:
it_it: Nel file ``build/conf/local.conf``, aggiungere queste 2 righe alla fine del file:

source: In the future, a "Commit and Push to GitHub" and an "Open Pull Request" button will be added to make the workflow more streamlined.
it_it: In futuro, verranno aggiunti i pulsanti "Commit and Push to GitHub" e "Open Pull Request" per semplificare il flusso di lavoro.

source: In the input device using the ``indev->rotary_sensitivity`` field (1/256 unit)
it_it: Nel dispositivo di input utilizzando il campo ``indev->rotary_sensitivity`` (1/256 di unità)

source: In the input field of "Open Project", the URL of a GitHub repository or a folder can be pasted and by clicking "Load Project," in a few seconds it will be opened.
it_it: Nel campo di input "Open Project", è possibile incollare l'URL di un repository GitHub o di una cartella e, cliccando su "Load Project", in pochi secondi verrà aperto.

source: In the interest of fostering an open and welcoming environment, we as contributors and maintainers pledge to making participation in our project and our community a harassment-free experience for everyone, regardless of age, body size, disability, ethnicity, gender identity and expression, level of experience, nationality, personal appearance, race, religion, or sexual identity and orientation.
it_it: Nell'interesse di promuovere un ambiente aperto e accogliente, noi, in qualità di contributori e promotori, ci impegniamo a rendere la partecipazione al nostro progetto e alla nostra community un'esperienza libera da molestie per tutti, indipendentemente da età, corporatura, disabilità, etnia, identità ed espressione di genere, livello di esperienza, nazionalità, aspetto fisico, razza, religione o identità e orientamento sessuale.

source: In the latter case the knob moves to the point clicked and the Slider value changes accordingly.
it_it: In quest'ultimo caso, la manopola si sposta nel punto cliccato e il valore dello Slider cambia di conseguenza.

source: In the latter case, the Line's width/height may need to be set explicitly using :cpp:func:`lv_obj_set_width` and :cpp:func:`lv_obj_set_height`, as percentage values do not automatically expand the bounding box.
it_it: In quest'ultimo caso, potrebbe essere necessario impostare esplicitamente la larghezza/altezza della Linea utilizzando :cpp:func:`lv_obj_set_width` e :cpp:func:`lv_obj_set_height`, poiché i valori percentuali non espandono automaticamente il riquadro di delimitazione.

source: In the most basic case it looks like this:
it_it: Nel caso più semplice, il risultato è questo:

source: In the process of using the Pinyin input method plug-in, you can change the Keyboard and dictionary at any time.
it_it: Durante l'utilizzo del plug-in per il metodo di input Pinyin, è possibile modificare la tastiera e il dizionario in qualsiasi momento.

source: In the root ``<translations>`` tag, the ``languages`` attribute defines the available languages, e.g., ``languages="en de hu"``.
it_it: Nel tag radice ``<translations>``, l'attributo ``languages`` definisce le lingue disponibili, ad esempio ``languages="en de hu"``.

source: In the search bar, type the library name (i.e. “lvgl”).
it_it: Nella barra di ricerca, digitare il nome della libreria (ad es. “lvgl”).

source: In the simplest case, it means removing all comments and insignificant whitespace.
it_it: Nel caso più semplice, significa rimuovere tutti i commenti e gli spazi vuoti non significativi.

source: In the text, you can use commands to recolor parts of the text.
it_it: Nel testo, è possibile utilizzare comandi per ricolorare parti del testo.

source: In the very same way, events can be attached to input devices and displays like this:
it_it: Allo stesso modo, gli eventi possono essere associati a dispositivi di input e display in questo modo:
